{
    "common": {
        "name": "dysonairpurifier",
        "version": "2.5.8",
        "news": {
            "2.5.8": {
                "en": "Fixed calculation of hmax values for heaters",
                "de": "Berechnung der hmax-Werte für Heizungen korrigiert",
                "ru": "Исправлен расчет значений hmax для обогревателей",
                "pt": "Cálculo fixo de valores hmax para aquecedores",
                "nl": "Vaste berekening van hmax-waarden voor verwarmingen",
                "fr": "Calcul fixe des valeurs hmax pour les appareils de chauffage",
                "it": "Calcolo fisso dei valori hmax per i riscaldatori",
                "es": "Cálculo fijo de valores hmax para calentadores.",
                "pl": "Naprawiono obliczanie wartości hmax dla grzejników",
                "uk": "Виправлено розрахунок значень hmax для нагрівачів",
                "zh-cn": "修复了加热器 hmax 值的计算"
            },
            "2.5.7": {
                "en": "Added support for Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K)",
                "de": "Unterstützung für Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K) hinzugefügt",
                "ru": "Добавлена ​​поддержка Dyson Pure Humidify+Cool Formальдегид (PH04, ProductType 358K).",
                "pt": "Adicionado suporte para Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K)",
                "nl": "Ondersteuning toegevoegd voor Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K)",
                "fr": "Ajout de la prise en charge de Dyson Pure Humidify+Cool Formaldéhyde (PH04, ProductType 358K)",
                "it": "Aggiunto il supporto per Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K)",
                "es": "Se agregó soporte para Dyson Pure Humidify+Cool Formaldehído (PH04, ProductType 358K)",
                "pl": "Dodano obsługę Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K)",
                "uk": "Додано підтримку для Dyson Pure Humidify+Cool Formaldehyde (PH04, ProductType 358K)",
                "zh-cn": "添加了对 Dyson Pure Humidify+Cool Formaldehyde（PH04，产品类型 358K）的支持"
            },
            "2.5.6": {
                "en": "Fix: Fixed warning due to wrong data type on field FILTER_REPLACEMENT.",
                "de": "Fix: Warnung wegen falschem Datentyp im Feld FILTER_REPLACEMENT behoben.",
                "ru": "Исправлено: исправлено предупреждение из-за неправильного типа данных в поле FILTER_REPLACEMENT.",
                "pt": "Correção: Corrigido o aviso devido ao tipo de dados errado no campo FILTER_REPLACEMENT.",
                "nl": "Oplossing: waarschuwing verholpen vanwege verkeerd gegevenstype in veld FILTER_REPLACEMENT.",
                "fr": "Correction : avertissement corrigé en raison d'un type de données incorrect sur le champ FILTER_REPLACEMENT.",
                "it": "Correzione: risolto avviso a causa di un tipo di dati errato nel campo FILTER_REPLACEMENT.",
                "es": "Solución: se corrigió la advertencia debido a un tipo de datos incorrecto en el campo FILTER_REPLACEMENT.",
                "pl": "Poprawka: Naprawiono ostrzeżenie z powodu nieprawidłowego typu danych w polu FILTER_REPLACEMENT.",
                "uk": "Виправлення: виправлено попередження через неправильний тип даних у полі FILTER_REPLACEMENT.",
                "zh-cn": "修复：修复了由于字段 FILTER_REPLACEMENT 上的错误数据类型而导致的警告。"
            },
            "2.5.4": {
                "en": "Upd: Downgraded axios to 0.27.2 due to an error in version 1.x returning data as binary instead of string.",
                "de": "Upd: axios auf 0.27.2 herabgestuft aufgrund eines Fehlers in Version 1.x, der Daten als Binärdatei statt als Zeichenfolge zurückgibt.",
                "ru": "Upd: понижена версия axios до 0.27.2 из-за ошибки в версии 1.x, возвращающей данные в виде двоичных данных вместо строки.",
                "pt": "Upd: Axios rebaixados para 0.27.2 devido a um erro na versão 1.x retornando dados como binários em vez de string.",
                "nl": "Upd: axios gedowngraded naar 0.27.2 vanwege een fout in versie 1.x die gegevens retourneerde als binair in plaats van als string.",
                "fr": "Mise à jour : Axios rétrogradé à 0.27.2 en raison d'une erreur dans la version 1.x renvoyant des données sous forme binaire au lieu de chaîne.",
                "it": "Aggiornamento: Axios declassato a 0.27.2 a causa di un errore nella versione 1.x che restituisce i dati come binari invece che come stringhe.",
                "es": "Actualizar: axios degradado a 0.27.2 debido a un error en la versión 1.x que devuelve datos como binarios en lugar de cadenas.",
                "pl": "Aktualizacja: Obniżono wersję axios do 0.27.2 z powodu błędu w wersji 1.x zwracającej dane w postaci binarnej zamiast łańcuchowej.",
                "uk": "Оновлено: axios знижено до 0.27.2 через помилку у версії 1.x, що повертає дані як двійкові, а не як рядки.",
                "zh-cn": "更新：由于版本 1.x 中的错误将 axios 降级为 0.27.2，返回数据为二进制而不是字符串。"
            },
            "2.5.3": {
                "en": "Upd: Dependencies got updated\nChg: easier and better detection of supported devices",
                "de": "Upd: Abhängigkeiten wurden aktualisiert\nChg: einfachere und bessere Erkennung von unterstützten Geräten",
                "ru": "Upd: Зависимости обновлены \n Chg: более простое и лучшее определение поддерживаемых устройств",
                "pt": "Upd: As dependências foram atualizadas\nChg: detecção mais fácil e melhor dos dispositivos suportados",
                "nl": "Upd: afhankelijkheden zijn bijgewerkt \nChg: eenvoudigere en betere detectie van ondersteunde apparaten",
                "fr": "Mise à jour : les dépendances ont été mises à jour \n Chg : détection plus facile et meilleure des appareils pris en charge",
                "it": "Aggiornamento: le dipendenze sono state aggiornate\n Modifica: rilevamento più semplice e migliore dei dispositivi supportati",
                "es": "Actualización: las dependencias se actualizaron \n Cambio: detección más fácil y mejor de los dispositivos compatibles",
                "pl": "Aktualizacja: Zaktualizowano zależności\nZmiana: łatwiejsze i lepsze wykrywanie obsługiwanych urządzeń",
                "uk": "Оновлено: оновлено залежності\nЗмінено: простіше та краще виявлення підтримуваних пристроїв",
                "zh-cn": "Upd：更新了依赖关系\n Chg：更容易和更好地检测支持的设备"
            },
            "2.5.2": {
                "en": "New: Added Dyson Pure Cool Tower Formaldehyde (Type 438K) to device list.\nNew: Added Dyson Pure Hot+Cool Formaldehyde (Type 527K) to device list.\nChg: Moved log message requesting new state of device from info to debug\nUpd: Dependencies got updated",
                "de": "Neu: Dyson Pure Cool Tower Formaldehyd (Typ 438K) zur Geräteliste hinzugefügt.\nNeu: Dyson Pure Hot+Cool Formaldehyd (Typ 527K) zur Geräteliste hinzugefügt.\nÄnderung: Protokollnachricht, die einen neuen Gerätestatus anfordert, von „Info“ in „Debug“ geändert\n Upd: Abhängigkeiten wurden aktualisiert",
                "ru": "Новое: в список устройств добавлен формальдегид Dyson Pure Cool Tower (тип 438K).\n Новое: в список устройств добавлен формальдегид Dyson Pure Hot+Cool (тип 527K). Upd: Зависимости обновлены",
                "pt": "Novo: Adicionado Formaldeído Dyson Pure Cool Tower (Tipo 438K) à lista de dispositivos.\nNovo: Adicionado Formaldeído Dyson Pure Hot+Cool (Tipo 527K) à lista de dispositivos.\nChg: Mensagem de registro movida solicitando novo estado do dispositivo de informações para depuração\n Upd: As dependências foram atualizadas",
                "nl": "Nieuw: Dyson Pure Cool Tower Formaldehyde (Type 438K) toegevoegd aan apparatenlijst.\nNieuw: Dyson Pure Hot+Cool Formaldehyde (Type 527K) toegevoegd aan apparatenlijst.\nChg: Verplaatst logbericht met verzoek om nieuwe apparaatstatus van info naar foutopsporing\n Upd: afhankelijkheden zijn bijgewerkt",
                "fr": "Nouveau : Ajout du Dyson Pure Cool Tower Formaldéhyde (Type 438K) à la liste des appareils.\nNouveau : Ajout du Dyson Pure Hot+Cool Formaldéhyde (Type 527K) à la liste des appareils.\nChg : Message de journal déplacé demandant le nouvel état de l'appareil d'info à débogage\n Mise à jour : les dépendances ont été mises à jour",
                "it": "Novità: aggiunto Dyson Pure Cool Tower Formaldeide (tipo 438K) all'elenco dei dispositivi.\nNovità: aggiunto Dyson Pure Hot+Cool formaldeide (tipo 527K) all'elenco dei dispositivi.\nChg: messaggio di registro spostato che richiede il nuovo stato del dispositivo dalle informazioni al debug\n Aggiorna: le dipendenze sono state aggiornate",
                "es": "Nuevo: Se agregó Dyson Pure Cool Tower Formaldehído (Tipo 438K) a la lista de dispositivos.\nNuevo: Se agregó Dyson Pure Hot+Cool Formaldehído (Tipo 527K) a la lista de dispositivos.\nCambiar: Se movió el mensaje de registro solicitando el nuevo estado del dispositivo de información a depuración\n Actualizar: las dependencias se actualizaron",
                "pl": "Nowość: Dodano Dyson Pure Cool Tower Formaldehyd (Typ 438K) do listy urządzeń.\nNowość: Dodano Dyson Pure Hot+Cool Formaldehyd (Typ 527K) do listy urządzeń.\nZmiana: Przeniesiono komunikat dziennika z żądaniem nowego stanu urządzenia z informacji do debugowania\n Aktualizacja: Zależności zostały zaktualizowane",
                "uk": "Нове: додано Dyson Pure Cool Tower Formaldehyde (тип 438K) до списку пристроїв.\nНове: додано Dyson Pure Hot+Cool Formaldehyde (тип 527K) до списку пристроїв.\nChg: переміщено повідомлення журналу із запитом нового стану пристрою з інформації до налагодження\n Оновлено: залежності оновлено",
                "zh-cn": "新：将 Dyson Pure Cool Tower Formaldehyde（438K 型）添加到设备列表。\n新：将 Dyson Pure Hot+Cool Formaldehyde（527K 型）添加到设备列表。\n更改：将请求设备新状态的日志消息从信息移至调试\n更新：依赖项已更新"
            },
            "2.5.1": {
                "en": "Improved layout of config page and added tooltips to checkboxes.",
                "de": "Verbessertes Layout der Konfigurationsseite und Tooltips zu Kontrollkästchen hinzugefügt.",
                "ru": "Улучшен макет страницы конфигурации и добавлены всплывающие подсказки к флажкам.",
                "pt": "Layout aprimorado da página de configuração e dicas de ferramentas adicionadas às caixas de seleção.",
                "nl": "Verbeterde lay-out van de configuratiepagina en tooltips toegevoegd aan selectievakjes.",
                "fr": "Mise en page améliorée de la page de configuration et ajout d'info-bulles aux cases à cocher.",
                "it": "Layout migliorato della pagina di configurazione e aggiunta di suggerimenti alle caselle di controllo.",
                "es": "Se mejoró el diseño de la página de configuración y se agregó información sobre herramientas a las casillas de verificación.",
                "pl": "Ulepszony układ strony konfiguracji i dodane podpowiedzi do pól wyboru.",
                "zh-cn": "改进了配置页面的布局并为复选框添加了工具提示。",
                "uk": "Покращено макет сторінки конфігурації та додано підказки до прапорців."
            },
            "2.5.0": {
                "en": "Added option to disable the logging of reconnect events.",
                "de": "Option hinzugefügt, um die Protokollierung von Wiederverbindungsereignissen zu deaktivieren.",
                "ru": "Добавлена ​​возможность отключить регистрацию событий переподключения.",
                "pt": "Adicionada opção para desabilitar o registro de eventos de reconexão.",
                "nl": "Optie toegevoegd om het loggen van herverbindingsgebeurtenissen uit te schakelen.",
                "fr": "Ajout d'une option pour désactiver la journalisation des événements de reconnexion.",
                "it": "Aggiunta opzione per disabilitare la registrazione degli eventi di riconnessione.",
                "es": "Opción agregada para deshabilitar el registro de eventos de reconexión.",
                "pl": "Dodano opcję wyłączenia rejestrowania zdarzeń ponownego połączenia.",
                "zh-cn": "添加了禁用重新连接事件记录的选项。",
                "uk": "Додано параметр для вимкнення реєстрації подій повторного підключення."
            },
            "2.4.1": {
                "en": "Changed SystemStates from type string to boolean",
                "de": "SystemStates vom Typ „String“ in „Boolean“ geändert",
                "ru": "Тип SystemStates изменен со строкового на логический.",
                "pt": "Alterado SystemStates do tipo string para booleano",
                "nl": "Systeemstatus gewijzigd van type string in boolean",
                "fr": "Changement de SystemStates de type chaîne en booléen",
                "it": "SystemStates modificato da tipo stringa a booleano",
                "es": "Cambiado SystemStates de tipo cadena a booleano",
                "pl": "Zmieniono stany systemowe z typu string na logiczne",
                "zh-cn": "将 SystemStates 从字符串类型更改为布尔值",
                "uk": "SystemStates змінено з рядкового типу на логічний"
            },
            "2.4.0": {
                "en": "Added warning code to device tree\nAdded Device-faults as SystemState to device tree\nAdded donate button to readme and config page\nSwitched \"Sending data to device\" message from loglevel info to debug\nreduced amount of debug messages\nUpdated dependencies,",
                "de": "Warncode zum Gerätebaum hinzugefügt\nGerätefehler als SystemState zum Gerätebaum hinzugefügt\nSpenden-Schaltfläche zur Readme- und Konfigurationsseite hinzugefügt\nMeldung \"Daten an Gerät senden\" von Loglevel-Info auf Debug umgestellt\nAnzahl der Debug-Meldungen reduziert\nAbhängigkeiten aktualisiert,",
                "ru": "Добавлен код предупреждения в дерево устройств\nДобавлены ошибки устройства как SystemState в дерево устройств\nДобавлена ​​кнопка пожертвования на страницу чтения и конфигурации\nПереключено сообщение «Отправка данных на устройство» с информации уровня журнала на отладку\nуменьшено количество отладочных сообщений\nОбновлены зависимости,",
                "pt": "Adicionado código de aviso à árvore de dispositivos\nAdicionado Device-falhas como SystemState à árvore de dispositivos\nAdicionado botão doar para leia-me e página de configuração\nMudança \"Enviando dados para dispositivo\" mensagem de informações de nível de log para depuração\nquantidade reduzida de mensagens de depuração\nDependências atualizadas,",
                "nl": "Waarschuwingscode toegevoegd aan apparaatstructuur\nApparaatfouten als systeemstatus toegevoegd aan apparaatstructuur\nDonatieknop toegevoegd aan leesmij- en configuratiepagina\nBericht \"Gegevens naar apparaat verzenden\" van logniveau-info naar foutopsporing\nverminderd aantal foutopsporingsberichten\nBijgewerkte afhankelijkheden,",
                "fr": "Ajout d'un code d'avertissement à l'arborescence des appareils\nAjout des défauts de l'appareil en tant que SystemState à l'arborescence des appareils\nAjout d'un bouton de don au fichier Lisez-moi et à la page de configuration\nChangement du message \"Envoi de données à l'appareil\" des informations de niveau de journalisation au débogage\nRéduction du nombre de messages de débogage\nDépendances mises à jour,",
                "it": "Aggiunto codice di avviso all'albero del dispositivo\nAggiunti errori del dispositivo come SystemState all'albero del dispositivo\nAggiunto pulsante di donazione alla pagina Leggimi e configurazione\nMessaggio \"Invio dati al dispositivo\" cambiato dalle informazioni a livello di log al debug\nRidotta quantità di messaggi di debug\nAggiornate dipendenze,",
                "es": "Se agregó un código de advertencia al árbol de dispositivos\nSe agregaron fallas de dispositivo como estado del sistema al árbol de dispositivos\nSe agregó un botón de donación a la página Léame y configuración",
                "pl": "Dodano kod ostrzeżenia do drzewa urządzeń\nDodano błędy urządzenia jako SystemState do drzewa urządzeń\nDodano przycisk darowizny do strony readme i konfiguracji\nPrzełączono komunikat „Wysyłanie danych do urządzenia” z informacji o poziomie logowania do debugowania\nzmniejszono liczbę komunikatów debugowania\nZaktualizowano zależności,",
                "zh-cn": "向设备树添加了警告代码\n将设备故障作为 SystemState 添加到设备树\n在自述文件和配置页面中添加了捐赠按钮\n将“向设备发送数据”消息从日志级别信息切换到调试\n减少了调试消息的数量\n更新了依赖项，",
                "uk": "Додано код попередження до дерева пристроїв\nДодано Device-faults як SystemState до дерева пристроїв\nДодано кнопку пожертви на сторінку readme і конфігурації\nПовідомлення «Надсилання даних на пристрій» змінено з інформації рівня журналу на налагодження\nзменшена кількість повідомлень про налагодження\nОновлені залежності,"
            }
        },
        "titleLang": {
            "en": "dyson air purifiers, air humidifiers, fan heater and fans",
            "de": "Dyson Luftreiniger, Luftbefeuchter, Heizlüfter und Lüfter",
            "ru": "очистители воздуха, увлажнители воздуха, тепловентилятор и вентиляторы dyson",
            "pt": "purificadores de ar da Dison, umidificadores de ar, aquecedor e ventiladores",
            "nl": "dyson luchtreinigers, luchtbevochtigers, luchtverhitter en ventilatoren",
            "fr": "Purificateurs d'air, humidificateurs d'air, radiateurs soufflants et ventilateurs dyson",
            "it": "purificatori d'aria dyson, umidificatori d'aria, termoventilatori e ventilatori",
            "es": "Purificadores de aire Dyson, humidificadores de aire, calefactores y ventiladores.",
            "pl": "oczyszczacze powietrza dyson, nawilżacze powietrza, nagrzewnice i wentylatory",
            "zh-cn": "戴森空气净化器，空气加湿器，风扇加热器和风扇",
            "uk": "очищувачі повітря, зволожувачі повітря, обігрівачі та вентилятори dyson"
        },
        "desc": {
            "en": "Integrate dyson air purifiers and fans into ioBroker",
            "de": "Integrieren Sie Dyson-Luftreiniger und -Lüfter in ioBroker",
            "ru": "Интегрируйте очистители воздуха и вентиляторы dyson в ioBroker",
            "pt": "Integre purificadores de ar e ventiladores dyson no ioBroker",
            "nl": "Integreer dyson-luchtreinigers en -ventilatoren in ioBroker",
            "fr": "Intégrez les purificateurs d'air et les ventilateurs Dyson dans ioBroker",
            "it": "Integra i purificatori d'aria e i ventilatori Dyson in ioBroker",
            "es": "Integre purificadores de aire y ventiladores Dyson en ioBroker",
            "pl": "Zintegruj oczyszczacze powietrza i wentylatory Dyson w ioBroker",
            "zh-cn": "将戴森空气净化器和风扇集成到ioBroker中",
            "uk": "Інтегруйте очищувачі повітря та вентилятори dyson в ioBroker"
        },
        "authors": [
            "grizzelbee <open.source@hingsen.de>"
        ],
        "keywords": [
            "dyson",
            "air purifier",
            "pure cool",
            "hot & cool",
            "humidify & cool",
            "fan"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "icon": "dyson_logo.svg",
        "adminUI": {
            "config": "materialize"
        },
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/Grizzelbee/ioBroker.dysonairpurifier/master/admin/dyson_logo.svg",
        "readme": "https://raw.githubusercontent.com/Grizzelbee/ioBroker.dysonairpurifier/master/readme.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "climate-control",
        "tier": 2,
        "compact": true,
        "materialize": true,
        "supportCustoms": false,
        "connectionType": "local",
        "dataSource": "poll",
        "messagebox": true,
        "subscribe": "messagebox",
        "dependencies": [
            {
                "js-controller": ">=3.0.0"
            }
        ],
        "plugins": {
            "sentry": {
                "dsn": "https://1016f555431c4acfb16b2481019aa1aa@o505019.ingest.sentry.io/5735771"
            }
        }
    },
    "native": {
        "email": "",
        "Password": "",
        "country": "de",
        "pollInterval": 30,
        "temperatureUnit": "C",
        "keepValues": false,
        "challengeId": "",
        "dyson_code": "",
        "token": "",
        "disableReconnectLogging": false
    },
    "encryptedNative": [
        "Password",
        "token"
    ],
    "protectedNative": [
        "Password",
        "token"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to dyson device",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
