{
    "common": {
        "name": "dysonairpurifier",
        "version": "1.2.0",
        "news": {
            "1.2.0": {
                "en": "Highlights: Breaking Change: All ON/OFF-switches are type bool now - Added DeepCleanCycle to known data points - Fix: Switching water hardness now really works - See changelog for all changes!",
                "de": "Highlights: Breaking Change: Alle ON/OFF-Schalter sind jetzt vom Typ bool - DeepCleanCycle zu bekannten Datenpunkten hinzugefügt - Fix: Wasserhärte-Umschaltung funktioniert jetzt wirklich - Siehe Changelog für alle Änderungen!",
                "ru": "Основные моменты: Критическое изменение: все переключатели ВКЛ / ВЫКЛ теперь имеют тип bool - Добавлен DeepCleanCycle к известным точкам данных - Исправлено: переключение жесткости воды теперь действительно работает - Все изменения см. В журнале изменений!",
                "pt": "Destaques: Mudança de ruptura: Todos os interruptores ON / OFF são do tipo bool agora - DeepCleanCycle adicionado a pontos de dados conhecidos - Correção: Mudar a dureza da água agora realmente funciona - Veja o changelog para todas as mudanças!",
                "nl": "Hoogtepunten: Verandering doorbreken: Alle AAN/UIT-schakelaars zijn nu van het type bool - DeepCleanCycle toegevoegd aan bekende datapunten - Oplossing: omschakelen van waterhardheid werkt nu echt - Zie changelog voor alle wijzigingen!",
                "fr": "Points forts : Changement révolutionnaire : tous les interrupteurs marche/arrêt sont désormais de type bool - Ajout de DeepCleanCycle aux points de données connus - Correction : La modification de la dureté de l'eau fonctionne maintenant vraiment - Voir le journal des modifications pour tous les changements !",
                "it": "Highlights: Breaking Change: tutti gli interruttori ON/OFF ora sono di tipo bool - Aggiunto DeepCleanCycle ai punti dati noti - Correzione: il cambio della durezza dell'acqua ora funziona davvero - Vedi il registro delle modifiche per tutte le modifiche!",
                "es": "Aspectos destacados: Cambio rotundo: todos los interruptores de ENCENDIDO / APAGADO son de tipo bool ahora - Se agregó DeepCleanCycle a puntos de datos conocidos - Solución: Cambiar la dureza del agua ahora realmente funciona - ¡Vea el registro de cambios para todos los cambios!",
                "pl": "Najważniejsze informacje: Najważniejsza zmiana: Wszystkie przełączniki ON/OFF są teraz typu bool - Dodano funkcję DeepCleanCycle do znanych punktów danych - Poprawka: Zmiana twardości wody teraz naprawdę działa - Zobacz dziennik zmian dla wszystkich zmian!",
                "zh-cn": "亮点： 重大变化：所有 ON/OFF 开关现在都是 bool 类型 - 将 DeepCleanCycle 添加到已知数据点 - 修复：现在切换水硬度确实有效 - 查看变更日志了解所有变化！"
            },
            "1.1.0": {
                "en": "Highlights: Added support for dyson Pure Hot+Cool Link (ProductType 455A) - Added support for formaldehyde sensor - Oscillation angles can be set - See changelog for all changes!",
                "de": "Highlights: Unterstützung für Dyson Pure Hot+Cool Link (Produkttyp 455A) hinzugefügt - Unterstützung für Formaldehydsensor hinzugefügt - Oszillationswinkel können eingestellt werden - Siehe Changelog für alle Änderungen!",
                "ru": "Основные моменты: Добавлена ​​поддержка dyson Pure Hot + Cool Link (ProductType 455A) - Добавлена ​​поддержка датчика формальдегида - Можно установить углы колебаний - Все изменения см. В журнале изменений!",
                "pt": "Destaques: Adicionado suporte para Dison Pure Hot + Cool Link (ProductType 455A) - Adicionado suporte para sensor de formaldeído - Ângulos de oscilação podem ser definidos - Consulte o changelog para todas as alterações!",
                "nl": "Hoogtepunten: Ondersteuning toegevoegd voor dyson Pure Hot+Cool Link (ProductType 455A) - Ondersteuning toegevoegd voor formaldehyde-sensor - Oscillatiehoeken kunnen worden ingesteld - Zie changelog voor alle wijzigingen!",
                "fr": "Points forts : Ajout de la prise en charge de dyson Pure Hot+Cool Link (ProductType 455A) - Ajout de la prise en charge du capteur de formaldéhyde - Les angles d'oscillation peuvent être définis - Voir le journal des modifications pour tous les changements !",
                "it": "In evidenza: Aggiunto supporto per Dyson Pure Hot+Cool Link (ProductType 455A) - Aggiunto supporto per sensore di formaldeide - È possibile impostare gli angoli di oscillazione - Vedere il registro delle modifiche per tutte le modifiche!",
                "es": "Aspectos destacados: Soporte agregado para dyson Pure Hot + Cool Link (ProductType 455A) - Soporte agregado para sensor de formaldehído - Se pueden configurar ángulos de oscilación - ¡Vea el registro de cambios para todos los cambios!",
                "pl": "Najważniejsze informacje: Dodano obsługę dyson Pure Hot+Cool Link (ProductType 455A) - Dodano obsługę czujnika formaldehydu - Można ustawić kąty oscylacji - Zobacz dziennik zmian dla wszystkich zmian!",
                "zh-cn": "亮点： 增加了对戴森 Pure Hot+Cool Link 的支持（产品类型 455A） - 增加了对甲醛传感器的支持 - 可以设置振荡角度 - 查看变更日志了解所有变化！"
            },
            "1.0.0": {
                "en": "Fixed \"wrong value for temperatures\" bug.",
                "de": "Fehler \"falscher Wert für Temperaturen\" behoben.",
                "ru": "Исправлена ​​ошибка \"неправильного значения температуры\".",
                "pt": "Corrigido bug de \"valor errado para temperaturas\".",
                "nl": "Bug \"verkeerde waarde voor temperaturen\" opgelost.",
                "fr": "Correction d'un bug \"mauvaise valeur pour les températures\".",
                "it": "Risolto bug \"valore errato per le temperature\".",
                "es": "Se corrigió el error de \"valor incorrecto para las temperaturas\".",
                "pl": "Naprawiono błąd \"niewłaściwej wartości temperatur\".",
                "zh-cn": "修复了“错误的温度值”错误。"
            },
            "0.9.5": {
                "en": "Fixed some new and some old bugs.",
                "de": "Einige neue und einige alte Fehler behoben.",
                "ru": "Исправлены некоторые новые и некоторые старые ошибки.",
                "pt": "Corrigido alguns bugs novos e antigos.",
                "nl": "Enkele nieuwe en enkele oude bugs verholpen.",
                "fr": "Correction de quelques nouveaux et anciens bugs.",
                "it": "Risolti alcuni bug nuovi e alcuni vecchi.",
                "es": "Se corrigieron algunos errores nuevos y algunos viejos.",
                "pl": "Naprawiono kilka nowych i kilka starych błędów.",
                "zh-cn": "修复了一些新的和一些旧的错误。"
            },
            "0.9.4": {
                "en": "Added some debug code - no new features.",
                "de": "Debug-Code hinzugefügt - keine neuen Funktionen.",
                "ru": "Добавлен отладочный код - новых функций нет.",
                "pt": "Adicionado algum código de depuração - sem novos recursos.",
                "nl": "Wat debug-code toegevoegd - geen nieuwe functies.",
                "fr": "Ajout de code de débogage - pas de nouvelles fonctionnalités.",
                "it": "Aggiunto del codice di debug - nessuna nuova funzionalità.",
                "es": "Se agregó un código de depuración, sin características nuevas.",
                "pl": "Dodano trochę kodu debugowania - brak nowych funkcji.",
                "zh-cn": "添加了一些调试代码 - 没有新功能。"
            },
            "0.9.3": {
                "en": "Added some debug code - no new features.",
                "de": "Debug-Code hinzugefügt - keine neuen Funktionen.",
                "ru": "Добавлен отладочный код - новых функций нет.",
                "pt": "Adicionado algum código de depuração - sem novos recursos.",
                "nl": "Wat debug-code toegevoegd - geen nieuwe functies.",
                "fr": "Ajout de code de débogage - pas de nouvelles fonctionnalités.",
                "it": "Aggiunto del codice di debug - nessuna nuova funzionalità.",
                "es": "Se agregó un código de depuración, sin características nuevas.",
                "pl": "Dodano trochę kodu debugowania - brak nowych funkcji.",
                "zh-cn": "添加了一些调试代码 - 没有新功能。"
            },
            "0.9.2": {
                "en": "Added support for switzerland and updated certificate as well as dependencies.",
                "de": "Unterstützung für die Schweiz und aktualisierte Zertifikate sowie Abhängigkeiten hinzugefügt.",
                "ru": "Добавлена ​​поддержка Швейцарии и обновлен сертификат, а также зависимости.",
                "pt": "Adicionado suporte para suíça e certificado atualizado, bem como dependências.",
                "nl": "Ondersteuning toegevoegd voor Zwitserland en bijgewerkt certificaat en afhankelijkheden.",
                "fr": "Ajout de la prise en charge de la suisse et mise à jour du certificat ainsi que des dépendances.",
                "it": "Aggiunto supporto per la Svizzera e certificato aggiornato e dipendenze.",
                "es": "Se agregó soporte para Suiza y certificado actualizado, así como dependencias.",
                "pl": "Dodano obsługę Szwajcarii i zaktualizowano certyfikat oraz zależności.",
                "zh-cn": "添加了对瑞士和更新的证书以及依赖项的支持。"
            },
            "0.9.1": {
                "en": "TP02, HP02  and others are now supporting the OFF state.",
                "de": "TP02, HP02  und andere unterstützen jetzt den AUS-Zustand.",
                "ru": "TP02, HP02  и другие теперь поддерживают состояние ВЫКЛ.",
                "pt": "TP02, HP02  e outros agora suportam o estado OFF.",
                "nl": "TP02, HP02  en anderen ondersteunen nu de UIT-status.",
                "fr": "TP02, HP02  et d'autres prennent désormais en charge l'état OFF.",
                "it": "TP02, HP02  e altri supportano ora lo stato OFF.",
                "es": "TP02, HP02  y otros ahora admiten el estado APAGADO.",
                "pl": "TP02, HP02  i inne obsługują teraz stan WYŁĄCZONY.",
                "zh-cn": "TP02, HP02和其他设备现在支持OFF状态。"
            },
            "0.9.0": {
                "en": "Support for new dyson 2 factor login procedure, new features and bugfixes.",
                "de": "Unterstützung für neues Dyson 2-Faktor-Anmeldeverfahren, neue Funktionen und Bugfixes.",
                "ru": "Поддержка новой двухфакторной процедуры входа в систему Dyson, новых функций и исправлений.",
                "pt": "Suporte para novo procedimento de login do fator dyson 2, novos recursos e correções de bugs.",
                "nl": "Ondersteuning voor nieuwe aanmeldingsprocedure voor dyson 2-factoren, nieuwe functies en bugfixes.",
                "fr": "Prise en charge de la nouvelle procédure de connexion dyson 2 factor, de nouvelles fonctionnalités et de corrections de bogues.",
                "it": "Supporto per la nuova procedura di accesso a 2 fattori di dyson, nuove funzionalità e correzioni di bug.",
                "es": "Soporte para el nuevo procedimiento de inicio de sesión de factor de Dyson 2, nuevas funciones y correcciones de errores.",
                "pl": "Wsparcie dla nowej procedury logowania dyson 2, nowe funkcje i poprawki błędów.",
                "zh-cn": "支持新的dyson 2 factor登录过程，新功能和错误修正。"
            }
        },
        "title": "dyson AirPurifier",
        "titleLang": {
            "en": "dyson air purifiers, air humidifiers, fan heater and fans",
            "de": "Dyson Luftreiniger, Luftbefeuchter, Heizlüfter und Lüfter",
            "ru": "очистители воздуха, увлажнители воздуха, тепловентилятор и вентиляторы dyson",
            "pt": "purificadores de ar da Dison, umidificadores de ar, aquecedor e ventiladores",
            "nl": "dyson luchtreinigers, luchtbevochtigers, luchtverhitter en ventilatoren",
            "fr": "Purificateurs d'air, humidificateurs d'air, radiateurs soufflants et ventilateurs dyson",
            "it": "purificatori d'aria dyson, umidificatori d'aria, termoventilatori e ventilatori",
            "es": "Purificadores de aire Dyson, humidificadores de aire, calefactores y ventiladores.",
            "pl": "oczyszczacze powietrza dyson, nawilżacze powietrza, nagrzewnice i wentylatory",
            "zh-cn": "戴森空气净化器，空气加湿器，风扇加热器和风扇"
        },
        "desc": {
            "en": "Integrate dyson air purifiers and fans into ioBroker",
            "de": "Integrieren Sie Dyson-Luftreiniger und -Lüfter in ioBroker",
            "ru": "Интегрируйте очистители воздуха и вентиляторы dyson в ioBroker",
            "pt": "Integre purificadores de ar e ventiladores dyson no ioBroker",
            "nl": "Integreer dyson-luchtreinigers en -ventilatoren in ioBroker",
            "fr": "Intégrez les purificateurs d'air et les ventilateurs Dyson dans ioBroker",
            "it": "Integra i purificatori d'aria e i ventilatori Dyson in ioBroker",
            "es": "Integre purificadores de aire y ventiladores Dyson en ioBroker",
            "pl": "Zintegruj oczyszczacze powietrza i wentylatory Dyson w ioBroker",
            "zh-cn": "将戴森空气净化器和风扇集成到ioBroker中"
        },
        "authors": [
            "grizzelbee <open.source@hingsen.de>"
        ],
        "keywords": [
            "ioBroker",
            "dyson",
            "Smart Home",
            "home automation",
            "air purifier",
            "pure cool",
            "hot & cool",
            "fan"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "icon": "dyson_logo.svg",
        "adminUI": {
            "config": "materialize"
        },
        "enabled": true,
        "extIcon": "https://github.com/Grizzelbee/ioBroker.dysonairpurifier/blob/master/admin/dyson_logo.svg",
        "readme": "https://github.com/Grizzelbee/ioBroker.dysonairpurifier/blob/master/readme.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "climate-control",
        "tier": 2,
        "compact": true,
        "materialize": true,
        "supportCustoms": false,
        "connectionType": "local",
        "dataSource": "poll",
        "messagebox": true,
        "subscribe": "messagebox",
        "dependencies": [
            {
                "js-controller": ">=3.0.0",
                "admin": ">=4.0.9"
            }
        ],
        "plugins": {
            "sentry": {
                "dsn": "https://1016f555431c4acfb16b2481019aa1aa@o505019.ingest.sentry.io/5735771"
            }
        }
    },
    "native": {
        "email": "",
        "Password": "",
        "country": "de",
        "pollInterval": 30,
        "temperatureUnit": "C",
        "keepValues": false,
        "challengeId": "",
        "dyson_code": "",
        "token": ""
    },
    "encryptedNative": [
        "Password",
        "token"
    ],
    "protectedNative": [
        "Password",
        "token"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to dyson device",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}