{
    "common": {
        "name": "dysonairpurifier",
        "version": "0.9.0",
        "news": {
            "0.9.0": {
                "en": "Support for new dyson login procedure and bugfixes."
            },
            "0.8.0": {
                "en": "Improved humidifier support and bugfixes.",
                "de": "Verbesserte Luftbefeuchterunterstützung und Bugfixes.",
                "ru": "Улучшенная поддержка увлажнителя и исправления.",
                "pt": "Suporte para umidificador aprimorado e correções de bugs.",
                "nl": "Verbeterde ondersteuning voor luchtbevochtigers en bugfixes.",
                "fr": "Amélioration de la prise en charge de l'humidificateur et corrections de bogues.",
                "it": "Supporto per umidificatore migliorato e correzioni di bug.",
                "es": "Soporte mejorado del humidificador y corrección de errores.",
                "pl": "Ulepszona obsługa nawilżacza i poprawki błędów.",
                "zh-cn": "改进了加湿器支持和错误修正。"
            },
            "0.7.5": {
                "en": "Fix: Adapter get online again after changes to dyson cloud API login procedure.",
                "de": "Fix: Der Adapter wird nach Änderungen am Anmeldeverfahren der Dyson Cloud API wieder online geschaltet.",
                "ru": "Исправлено: Адаптер снова выходит в сеть после изменений в процедуре входа в облачный API dyson.",
                "pt": "Correção: o adaptador fica online novamente após alterações no procedimento de login da API do dyson cloud.",
                "nl": "Oplossing: adapter gaat weer online na wijzigingen in de aanmeldingsprocedure van de dyson cloud API.",
                "fr": "Correction: l'adaptateur est de nouveau en ligne après les modifications apportées à la procédure de connexion de l'API Dyson Cloud.",
                "it": "Correzione: l'adattatore torna online dopo le modifiche alla procedura di accesso all'API del cloud di dyson.",
                "es": "Solución: el adaptador vuelve a estar en línea después de los cambios en el procedimiento de inicio de sesión de la API en la nube de dyson.",
                "pl": "Poprawka: Adapter jest ponownie online po zmianie procedury logowania dyson Cloud API.",
                "zh-cn": "修复：更改dyson cloud API登录过程后，适配器再次联机。"
            },
            "0.7.4": {
                "en": "Bugfix release for some minor bugs",
                "de": "Bugfix Release für einige kleinere Fehler",
                "ru": "Выпуск исправлений для некоторых мелких ошибок",
                "pt": "Lançamento de correção de bug para alguns pequenos bugs",
                "nl": "Bugfix-uitgave voor enkele kleine bugs",
                "fr": "Publication de correctifs pour certains bogues mineurs",
                "it": "Rilascio di bugfix per alcuni bug minori",
                "es": "Lanzamiento de corrección de errores para algunos errores menores",
                "pl": "Wydanie poprawek dla kilku drobnych błędów",
                "zh-cn": "修正了一些小错误"
            },
            "0.7.3": {
                "en": "Bugfix release for some bug and improvements - Refer to changelog for details.",
                "de": "Bugfix-Version für einige Fehler und Verbesserungen - Einzelheiten finden Sie im Änderungsprotokoll.",
                "ru": "Выпуск исправлений для некоторых ошибок и улучшений - подробности см. В журнале изменений.",
                "pt": "Lançamento de correção de bug para alguns bugs e melhorias - Consulte o changelog para detalhes.",
                "nl": "Bugfix-uitgave voor enkele bug en verbeteringen - Raadpleeg de changelog voor details.",
                "fr": "Version de correctif pour certains bogues et améliorations - Reportez-vous au journal des modifications pour plus de détails.",
                "it": "Rilascio di bugfix per alcuni bug e miglioramenti - Fare riferimento al log delle modifiche per i dettagli.",
                "es": "Versión de corrección de errores para algunos errores y mejoras: consulte el registro de cambios para obtener más detalles.",
                "pl": "Wydanie poprawek błędów i ulepszeń - szczegółowe informacje znajdują się w dzienniku zmian.",
                "zh-cn": "Bugfix版本中的一些错误和改进-有关详细信息，请参考changelog。"
            },
            "0.7.2": {
                "en": "Bugfix for config issue.",
                "de": "Bugfix für Konfigurationsproblem.",
                "ru": "Исправление проблемы с конфигурацией.",
                "pt": "Correção de bug para problema de configuração.",
                "nl": "Bugfix voor configuratieprobleem.",
                "fr": "Correction de bug pour le problème de configuration.",
                "it": "Bugfix per problema di configurazione.",
                "es": "Corrección de errores para el problema de configuración.",
                "pl": "Poprawka dotycząca problemu z konfiguracją.",
                "zh-cn": "修正了配置问题。"
            },
            "0.7.1": {
                "en": "Many bugfixes and improvements - Refer to changelog for details.",
                "de": "Viele Bugfixes und Verbesserungen - Einzelheiten finden Sie im Änderungsprotokoll.",
                "ru": "Множество исправлений и улучшений - подробности см. В журнале изменений.",
                "pt": "Muitas correções de bugs e melhorias - Consulte o changelog para detalhes.",
                "nl": "Veel bugfixes en verbeteringen - Raadpleeg het changelog voor details.",
                "fr": "De nombreuses corrections de bugs et améliorations - Reportez-vous au journal des modifications pour plus de détails.",
                "it": "Molte correzioni di bug e miglioramenti - Fare riferimento al log delle modifiche per i dettagli.",
                "es": "Muchas correcciones de errores y mejoras: consulte el registro de cambios para obtener más detalles.",
                "pl": "Wiele poprawek i ulepszeń - szczegóły w dzienniku zmian.",
                "zh-cn": "许多错误修正和改进-有关详细信息，请参考changelog。"
            },
            "0.7.0": {
                "en": "Breaking-change - Many bugfixes and improvements - Refer to changelog for details.",
                "de": "Breaking-Change - Viele Bugfixes und Verbesserungen - Weitere Informationen finden Sie im Changelog.",
                "ru": "Критические изменения - Многие исправления и улучшения - Подробности см. В журнале изменений.",
                "pt": "Breaking-change - Muitas correções de bugs e melhorias - Consulte o changelog para detalhes.",
                "nl": "Breaking-change - Veel bugfixes en verbeteringen - Raadpleeg het changelog voor details.",
                "fr": "Breaking-change - De nombreuses corrections de bogues et améliorations - Reportez-vous au journal des modifications pour plus de détails.",
                "it": "Cambiamento decisivo - Molte correzioni di bug e miglioramenti - Fare riferimento al registro delle modifiche per i dettagli.",
                "es": "Cambio rotundo: muchas correcciones de errores y mejoras: consulte el registro de cambios para obtener más detalles.",
                "pl": "Przełomowa zmiana - Wiele poprawek i ulepszeń - Szczegółowe informacje można znaleźć w dzienniku zmian.",
                "zh-cn": "重大更改-许多错误修正和改进-有关详细信息，请参阅更改日志。"
            },
            "0.6.0": {
                "en": "minor bugfix and small improvements.",
                "de": "kleiner Bugfix und kleine Verbesserungen.",
                "ru": "мелкие исправления и небольшие улучшения.",
                "pt": "pequenas correções de bugs e pequenas melhorias.",
                "nl": "kleine bugfix en kleine verbeteringen.",
                "fr": "correction de bugs mineurs et petites améliorations.",
                "it": "bugfix minori e piccoli miglioramenti.",
                "es": "corrección de errores menores y pequeñas mejoras.",
                "pl": "drobne poprawki i drobne ulepszenia.",
                "zh-cn": "小错误修正和小改进。"
            },
            "0.5.1": {
                "en": "bugfix for missing clearTimeout.",
                "de": "Bugfix für fehlendes clearTimeout.",
                "ru": "исправление из-за отсутствия clearTimeout.",
                "pt": "correção de bug para clearTimeout ausente.",
                "nl": "bugfix voor het missen van clearTimeout.",
                "fr": "correctif pour le clearTimeout manquant.",
                "it": "bugfix per clearTimeout mancante.",
                "es": "corrección de errores por falta de clearTimeout.",
                "pl": "poprawka dla brakującego clearTimeout.",
                "zh-cn": "缺少clearTimeout的错误修正。"
            },
            "0.5.0": {
                "en": "enhancements, bugfixes and initial support for heater.",
                "de": "Verbesserungen, Bugfixes und anfängliche Unterstützung für die Heizung.",
                "ru": "улучшения, исправления и начальная поддержка нагревателя.",
                "pt": "melhorias, correções de bugs e suporte inicial para aquecedor.",
                "nl": "verbeteringen, bugfixes en initiële ondersteuning voor verwarming.",
                "fr": "améliorations, corrections de bugs et assistance initiale pour le chauffage.",
                "it": "miglioramenti, correzioni di bug e supporto iniziale per il riscaldatore.",
                "es": "mejoras, correcciones de errores y soporte inicial para calentador.",
                "pl": "ulepszenia, poprawki błędów i początkowe wsparcie dla podgrzewacza.",
                "zh-cn": "增强功能，错误修正和加热器的初始支持。"
            },
            "0.4.1": {
                "en": "enhancements and bugfixes.",
                "de": "Verbesserungen und Bugfixes.",
                "ru": "улучшения и исправления.",
                "pt": "melhorias e correções de bugs.",
                "nl": "verbeteringen en bugfixes.",
                "fr": "améliorations et corrections de bogues.",
                "it": "miglioramenti e correzioni di bug.",
                "es": "mejoras y correcciones de errores.",
                "pl": "ulepszenia i poprawki błędów.",
                "zh-cn": "增强功能和错误修正。"
            },
            "0.4.0": {
                "en": "Devices are controllable now, State changes get processed now, Some minor bugfixes.",
                "de": "Geräte sind jetzt steuerbar, Statusänderungen werden jetzt verarbeitet, einige kleinere Bugfixes.",
                "ru": "Теперь устройствами можно управлять, изменения состояния обрабатываются, исправлены мелкие ошибки.",
                "pt": "Dispositivos são controláveis ​​agora, mudanças de estado são processadas agora, algumas pequenas correções de bugs.",
                "nl": "Apparaten zijn nu bestuurbaar, statuswijzigingen worden nu verwerkt, enkele kleine bugfixes.",
                "fr": "Les appareils sont contrôlables maintenant, les changements d'état sont traités maintenant, quelques corrections de bugs mineurs.",
                "it": "I dispositivi sono ora controllabili, le modifiche di stato vengono elaborate ora, alcune correzioni di bug minori.",
                "es": "Los dispositivos son controlables ahora, los cambios de estado se procesan ahora, algunas correcciones de errores menores.",
                "pl": "Urządzenia można teraz kontrolować, zmiany stanu są przetwarzane teraz, kilka drobnych poprawek błędów.",
                "zh-cn": "设备现在是可控的，状态更改现在得到处理，一些小错误修正。"
            },
            "0.3.0": {
                "en": "Working so far - first version worth giving it a try.",
                "de": "Bisher funktioniert - erste Version, die es wert ist, ausprobiert zu werden.",
                "ru": "Пока работает - стоит попробовать первую версию.",
                "pt": "Funcionando até agora - vale a pena tentar a primeira versão.",
                "nl": "Werkend tot nu toe - eerste versie die het proberen waard is.",
                "fr": "Jusqu'à présent, la première version vaut la peine d'être essayée.",
                "it": "Finora funzionante: vale la pena provare la prima versione.",
                "es": "Funcionando hasta ahora, vale la pena probar la primera versión.",
                "pl": "Działam do tej pory - pierwsza wersja, którą warto spróbować.",
                "zh-cn": "到目前为止已经可以使用-值得尝试的第一个版本。"
            },
            "0.2.0": {
                "en": "second step for dyson Air purifier adapter (not working)",
                "de": "zweiter Schritt für Dyson Luftreinigeradapter (funktioniert nicht)",
                "ru": "второй шаг для адаптера очистителя воздуха dyson (не работает)",
                "pt": "segundo passo para adaptador de purificador de ar dyson (não funciona)",
                "nl": "tweede stap voor dyson Luchtreiniger adapter (werkt niet)",
                "fr": "deuxième étape pour l'adaptateur de purificateur d'air dyson (ne fonctionne pas)",
                "it": "secondo passaggio per l'adattatore del purificatore d'aria dyson (non funzionante)",
                "es": "segundo paso para el adaptador de purificador de aire Dyson (no funciona)",
                "pl": "Drugi krok dla adaptera oczyszczacza powietrza dyson (nie działa)",
                "zh-cn": "戴森空气净化器适配器的第二步（不起作用）"
            },
            "0.1.0": {
                "en": "first steps for dyson Air purifier adapter (not working)",
                "de": "erste Schritte für Dyson Luftreinigeradapter (funktioniert nicht)",
                "ru": "Первые шаги для адаптера очистителя воздуха dyson (не работает)",
                "pt": "primeiros passos para o adaptador de purificador de ar dyson (não funciona)",
                "nl": "eerste stappen voor dyson luchtreiniger adapter (werkt niet)",
                "fr": "premières étapes pour l'adaptateur de purificateur d'air dyson (ne fonctionne pas)",
                "it": "primi passi per l'adattatore del purificatore d'aria dyson (non funzionante)",
                "es": "primeros pasos para el adaptador de purificador de aire Dyson (no funciona)",
                "pl": "pierwsze kroki dla dyson Adapter oczyszczacza powietrza (nie działa)",
                "zh-cn": "戴森空气净化器适配器的第一步（不起作用）"
            }
        },
        "title": "dyson AirPurifier",
        "titleLang": {
            "en": "dyson air purifiers, air humidifiers, fan heater and fans",
            "de": "Dyson Luftreiniger, Luftbefeuchter, Heizlüfter und Lüfter",
            "ru": "очистители воздуха, увлажнители воздуха, тепловентилятор и вентиляторы dyson",
            "pt": "purificadores de ar da Dison, umidificadores de ar, aquecedor e ventiladores",
            "nl": "dyson luchtreinigers, luchtbevochtigers, luchtverhitter en ventilatoren",
            "fr": "Purificateurs d'air, humidificateurs d'air, radiateurs soufflants et ventilateurs dyson",
            "it": "purificatori d'aria dyson, umidificatori d'aria, termoventilatori e ventilatori",
            "es": "Purificadores de aire Dyson, humidificadores de aire, calefactores y ventiladores.",
            "pl": "oczyszczacze powietrza dyson, nawilżacze powietrza, nagrzewnice i wentylatory",
            "zh-cn": "戴森空气净化器，空气加湿器，风扇加热器和风扇"
        },
        "desc": {
            "en": "Integrate dyson air purifiers and fans into ioBroker",
            "de": "Integrieren Sie Dyson-Luftreiniger und -Lüfter in ioBroker",
            "ru": "Интегрируйте очистители воздуха и вентиляторы dyson в ioBroker",
            "pt": "Integre purificadores de ar e ventiladores dyson no ioBroker",
            "nl": "Integreer dyson-luchtreinigers en -ventilatoren in ioBroker",
            "fr": "Intégrez les purificateurs d'air et les ventilateurs Dyson dans ioBroker",
            "it": "Integra i purificatori d'aria e i ventilatori Dyson in ioBroker",
            "es": "Integre purificadores de aire y ventiladores Dyson en ioBroker",
            "pl": "Zintegruj oczyszczacze powietrza i wentylatory Dyson w ioBroker",
            "zh-cn": "将戴森空气净化器和风扇集成到ioBroker中"
        },
        "authors": [
            "Hanjo Hingsen <open.source@hingsen.de>"
        ],
        "keywords": [
            "ioBroker",
            "dyson",
            "Smart Home",
            "home automation",
            "air purifier",
            "pure cool",
            "hot & cool",
            "fan"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "icon": "dyson_logo.svg",
        "enabled": true,
        "extIcon": "https://github.com/Grizzelbee/ioBroker.dysonairpurifier/blob/master/admin/dyson_logo.svg",
        "readme": "https://github.com/Grizzelbee/ioBroker.dysonairpurifier/blob/master/readme.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "climate-control",
        "compact": true,
        "materialize": true,
        "supportCustoms": false,
        "connectionType": "local",
        "dataSource": "poll",
        "dependencies": [
            {
                "js-controller": ">=3.0.0",
                "admin": ">=4.0.9"
            }
        ]
    },
    "native": {
        "email": "",
        "Password": "",
        "country": "de",
        "pollInterval": 30,
        "temperatureUnit": "C"
    },
    "encryptedNative": [
        "Password"
    ],
    "protectedNative": [
        "Password"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to dyson device",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}